{"img_local_path": "test/1600.jpg", "original_caption1": "Construction worker Hiraku Sasaki washes at a public bath.", "caption1_mod": "Construction worker PERSON washes at a public bath.", "img_gen1": "SDtest/1600gen1.jpg", "original_caption2": "A man with body tattoos pours water over his back", "caption2_mod": "A man with body tattoos pours water over his back", "img_gen2": "SDtest/1600gen2.jpg", "label": 0}
{"img_local_path": "test/1601.png", "original_caption1": "A photograph of a group of men wearing shirts saying “I Can Breathe” spread online between late May and early June 2020 after the death of an unarmed Black man named George Floyd while in custody of Derek Chauvin, a white Minneapolis police officer.", "caption1_mod": "A photograph of a group of men wearing shirts saying “I Can Breathe” spread online between late May and early June 2020 after the  of an unarmed Black man named PERSON while in custody of PERSON, a white Minneapolis police officer.", "img_gen1": "SDtest/1601gen1.jpg", "original_caption2": "These images are from a 2014 rally supporting the NYPD after the death of Garner, and not in response to the death of Floyd.", "caption2_mod": "These images are from a 2014 rally supporting the NYPD after the  of Garner, and not in response to the  of PERSON.", "img_gen2": "SDtest/1601gen2.jpg", "label": 1}
{"img_local_path": "test/1602.jpg", "original_caption1": "Image shows a CDP supporter", "caption1_mod": "Image shows a CDP supporter", "img_gen1": "SDtest/1602gen1.jpg", "original_caption2": "A supporter dances at a campaign rally for presidential candidate for the Congress for Democracy and Progress (CDP) party", "caption2_mod": "A supporter dances at a campaign rally for presidential candidate for the Congress for Democracy and Progress (CDP) party", "img_gen2": "SDtest/1602gen2.jpg", "label": 0}
{"img_local_path": "test/1603.jpg", "original_caption1": "Nigerian Airforce planes fly past a 60th anniversary banner at Aso Rock in the capital, Abuja, on Thursday, as the nation celebrates 60 years of independence...", "caption1_mod": "Nigerian Airforce planes fly past a 60th anniversary banner at Aso Rock in the capital, Abuja, on Thursday, as the nation celebrates 60 years of independence...", "img_gen1": "SDtest/1603gen1.jpg", "original_caption2": "Nigerian Airforce Planes fly past a Nigerian 60th anniversary banner at the Aso-Rock in Abuja, Nigeria during the countrys 60th Independence Celebration on October 1, 2020.", "caption2_mod": "Nigerian Airforce Planes fly past a Nigerian 60th anniversary banner at the Aso-Rock in Abuja, Nigeria during the countrys 60th Independence Celebration on October 1, 2020.", "img_gen2": "SDtest/1603gen2.jpg", "label": 0}
{"img_local_path": "test/1604.png", "original_caption1": "A photograph shows U.S. Rep. Lauren Boebert with a group of insurrectionists on the steps of the U.S. Capitol the day before the Jan. 6 riot.", "caption1_mod": "A photograph shows U.S. Rep. PERSON with a group of ists on the steps of the U.S. Capitol the day before the Jan. 6 riot.", "img_gen1": "SDtest/1604gen1.jpg", "original_caption2": "Colorado Times Recorder reported in December 2019 that Boebert, who had just launched her campaign for Congress, had attended a rally against the state’s “red flag” law, which allows authorities to take guns from people who are deemed a threat.", "caption2_mod": "Colorado Times Recorder reported in December 2019 that PERSON, who had just launched her campaign for Congress, had attended a rally against the state’s “red flag” law, which allows authorities to take guns from people who are deemed a threat.", "img_gen2": "SDtest/1604gen2.jpg", "label": 1}
{"img_local_path": "test/1605.jpg", "original_caption1": "Prime Minister Benjamin Netanyahu of Israel delivered a prime-time speech on Monday to attack an investigation he called a \"joke\" and \"absurdity.\"", "caption1_mod": "Prime Minister PERSON of Israel delivered a prime-time speech on Monday to attack an investigation he called a \"joke\" and \"absurdity.\"", "img_gen1": "SDtest/1605gen1.jpg", "original_caption2": "Benjamin Netanyahu delivers a speech in which he demanded to face his accusers live on television.", "caption2_mod": "PERSON delivers a speech in which he demanded to face his accusers live on television.", "img_gen2": "SDtest/1605gen2.jpg", "label": 0}
{"img_local_path": "test/1606.png", "original_caption1": "A video shows people in China tearing down a 5G tower in an attempt to stop the spread of COVID-19 coronavirus disease.", "caption1_mod": "A video shows people in China tearing down a 5G tower in an attempt to stop the spread of   disease.", "img_gen1": "SDtest/1606gen1.jpg", "original_caption2": "This video is real, but it has nothing to do with 5G or the coronavirus pandemic.", "caption2_mod": "This video is real, but it has nothing to do with 5G or the  pandemic.", "img_gen2": "SDtest/1606gen2.jpg", "label": 1}
{"img_local_path": "test/1607.jpg", "original_caption1": "A woman sunbathes on a deck chair in Greenwich Park, London", "caption1_mod": "A woman sunbathes on a deck chair in Greenwich Park, London", "img_gen1": "SDtest/1607gen1.jpg", "original_caption2": "A woman sunbathes on a deck chair in Greenwich Park, with buildings in the distance", "caption2_mod": "A woman sunbathes on a deck chair in Greenwich Park, with buildings in the distance", "img_gen2": "SDtest/1607gen2.jpg", "label": 0}
{"img_local_path": "test/1608.jpg", "original_caption1": "And South Africans wait to pay tribute to the passing funeral procession of anti-apartheid activist George Bizos.", "caption1_mod": "And South Africans wait to pay tribute to the passing funeral procession of anti-apartheid activist PERSON.", "img_gen1": "SDtest/1608gen1.jpg", "original_caption2": "Children and adults wait on a pavement next to an illusatration of George Bizos.", "caption2_mod": "Children and adults wait on a pavement next to an illusatration of PERSON.", "img_gen2": "SDtest/1608gen2.jpg", "label": 0}
{"img_local_path": "test/1609.jpg", "original_caption1": "Nicky Clough visits her mother Pam Harrison in her bedroom at Alexander House Care Home in London. Care home residents were allowed one regular visitor from 8 March, subject to certain conditions, as part of the easing of England's lockdown.", "caption1_mod": "Nicky Clough visits her mother PERSON in her bedroom at Alexander House Care Home in London. Care home residents were allowed one regular visitor from 8 March, subject to certain conditions, as part of the easing of England's lockdown.", "img_gen1": "SDtest/1609gen1.jpg", "original_caption2": "Nicky Clough visits her mother Pam Harrison in her bedroom at Alexander House Care Home in London, England, 8 March 2021.", "caption2_mod": "Nicky Clough visits her mother PERSON in her bedroom at Alexander House Care Home in London, England, 8 March 2021.", "img_gen2": "SDtest/1609gen2.jpg", "label": 0}
{"img_local_path": "test/1610.png", "original_caption1": "Road at night, with a car pulled over and a person lying on his or her back in the middle of the road", "caption1_mod": "Road at night, with a car pulled over and a person lying on his or her back in the middle of the road", "img_gen1": "SDtest/1610gen1.jpg", "original_caption2": "No evidence was found that the photographs included in the November and December 2019 Facebook posts showed a specific incident of attempted sex trafficking.", "caption2_mod": "No evidence was found that the photographs included in the November and December 2019 Facebook posts showed a specific incident of attempted  .", "img_gen2": "SDtest/1610gen2.jpg", "label": 1}
{"img_local_path": "test/1611.jpg", "original_caption1": "India clears purchase of Russian combat jets worth $2.4 billion", "caption1_mod": "India clears purchase of Russian combat jets worth $2.4 billion", "img_gen1": "SDtest/1611gen1.jpg", "original_caption2": "Kashmir braces for worst as shelling, gunbattles escalate", "caption2_mod": "Kashmir braces for worst as shelling, gunbattles escalate", "img_gen2": "SDtest/1611gen2.jpg", "label": 0}
{"img_local_path": "test/1612.jpg", "original_caption1": "President Obama achieved the lowest IQ score among all U.S. presidents of the last 100 years.", "caption1_mod": "President PERSON achieved the lowest IQ score among all U.S. presidents of the last 100 years.", "img_gen1": "SDtest/1612gen1.jpg", "original_caption2": "A website ‘Empire News’ published an article on 12th December 2015 indicating that the U.S President Barak Obama has marked the lowest score among all the former U.S Presidents for IQ testing since 1913.", "caption2_mod": "A website ‘Empire News’ published an article on 12th December 2015 indicating that the U.S President PERSON has marked the lowest score among all the former U.S Presidents for IQ testing since 1913.", "img_gen2": "SDtest/1612gen2.jpg", "label": 1}
{"img_local_path": "test/1613.jpg", "original_caption1": "Rum seen from a cave on Eigg", "caption1_mod": "Rum seen from a cave on Eigg", "img_gen1": "SDtest/1613gen1.jpg", "original_caption2": "The Isle of Rum framed in the entrance of a cave on the shore of the Isle of Eigg in a picture from Arthur Campbell.", "caption2_mod": "The Isle of Rum framed in the entrance of a cave on the shore of the Isle of Eigg in a picture from PERSON.", "img_gen2": "SDtest/1613gen2.jpg", "label": 0}
{"img_local_path": "test/1614.jpg", "original_caption1": "The Trump administration is making Puerto Ricans sign promissory notes and surrender passports before evacuating them or rendering aid.", "caption1_mod": "The PERSON administration is making Puerto Ricans sign promissory notes and surrender passports before evacuating them or rendering aid.", "img_gen1": "SDtest/1614gen1.jpg", "original_caption2": "Two palm trees in the wind", "caption2_mod": "Two palm trees in the wind", "img_gen2": "SDtest/1614gen2.jpg", "label": 1}
{"img_local_path": "test/1615.jpg", "original_caption1": "The first dog Major arrives at the White House, alongside fellow German Shepherd Champ, as President Biden begins his new administration in January 2021", "caption1_mod": "The first dog Major arrives at the White House, alongside fellow German PERSON, as President PERSON begins his new administration in January 2021", "img_gen1": "SDtest/1615gen1.jpg", "original_caption2": "The first dog Major runs across the White House lawn", "caption2_mod": "The first dog Major runs across the White House lawn", "img_gen2": "SDtest/1615gen2.jpg", "label": 0}
{"img_local_path": "test/1616.jpg", "original_caption1": "A photograph taken by the International Space Station shows bushfires raging across Australia.", "caption1_mod": "A photograph taken by the International Space Station shows bushfires raging across Australia.", "img_gen1": "SDtest/1616gen1.jpg", "original_caption2": "This is a 3D rendering (with an over exposure) of fire hotspots over a month from December 5 until January 5. Not a real photo.", "caption2_mod": "This is a 3D rendering (with an over exposure) of fire hotspots over a month from December 5 until January 5. Not a real photo.", "img_gen2": "SDtest/1616gen2.jpg", "label": 1}
{"img_local_path": "test/1617.jpg", "original_caption1": "A doctor collects a swab sample from a man to be tested for coronavirus, in Shah Alam, Malaysia.", "caption1_mod": "A doctor collects a swab sample from a man to be tested for , in Shah Alam, Malaysia.", "img_gen1": "SDtest/1617gen1.jpg", "original_caption2": "The art of the coronavirus pandemic on the wall", "caption2_mod": "The art of the  pandemic on the wall", "img_gen2": "SDtest/1617gen2.jpg", "label": 0}
{"img_local_path": "test/1618.jpg", "original_caption1": "Members of the migrant caravan dragging a Mexican official through the streets", "caption1_mod": "Members of the migrant caravan dragging a Mexican official through the streets", "img_gen1": "SDtest/1618gen1.jpg", "original_caption2": "Demonstrators apprehend a riot police officer near the airport in Acapulco", "caption2_mod": "Demonstrators apprehend a riot police officer near the airport in Acapulco", "img_gen2": "SDtest/1618gen2.jpg", "label": 1}
{"img_local_path": "test/1619.jpg", "original_caption1": "Linkin Park singer Chester Bennington, who passed away on 20 July 2017 in his Palos Verdes Estates home near Los Angeles, had been murdered in similar fashion to his friend, Soundgarden singer Chris Cornell, who died two months earlier.", "caption1_mod": "Linkin Park singer PERSON, who passed away on 20 July 2017 in his Palos Verdes Estates home near Los Angeles, had been ed in similar fashion to his friend, PERSON singer PERSON, who  two months earlier.", "img_gen1": "SDtest/1619gen1.jpg", "original_caption2": "There is no evidence that Bennington or Cornell were murdered in an effort to cover up a debunked pedophile sex ring.", "caption2_mod": "There is no evidence that Bennington or Cornell were ed in an effort to cover up a debunked   ring.", "img_gen2": "SDtest/1619gen2.jpg", "label": 1}
{"img_local_path": "test/1620.jpg", "original_caption1": "Andrea Stewart-Cousins began her tenure as majority leader as Democrats took control of the Senate for the first time in a decade.", "caption1_mod": "PERSON began her tenure as majority leader as Democrats took control of the Senate for the first time in a decade.", "img_gen1": "SDtest/1620gen1.jpg", "original_caption2": "Democrats hold the majority in the Assembly and the Senate in New York State. Senator Andrea Stewart-Cousins, center, is the first woman to be the majority leader of the State Senate.", "caption2_mod": "Democrats hold the majority in the Assembly and the Senate in New York State. Senator PERSON, center, is the first woman to be the majority leader of the State Senate.", "img_gen2": "SDtest/1620gen2.jpg", "label": 0}
{"img_local_path": "test/1621.jpg", "original_caption1": "An Afghan injured woman receives treatment at a hospital after a car bomb blast in Kabul, Afghanistan January 14, 2019.", "caption1_mod": "An Afghan injured woman receives treatment at a hospital after a car bomb blast in Kabul, Afghanistan January 14, 2019.", "img_gen1": "SDtest/1621gen1.jpg", "original_caption2": "An Afghan injured woman receives treatment at a hospital after a car bomb blast in Kabul, Afghanistan January 14, 2019.", "caption2_mod": "An Afghan injured woman receives treatment at a hospital after a car bomb blast in Kabul, Afghanistan January 14, 2019.", "img_gen2": "SDtest/1621gen2.jpg", "label": 0}
{"img_local_path": "test/1622.jpg", "original_caption1": "Photograph showing a mural that was painted at Denver International Airport in 1994 that depicted people from around the world wearing masks started to circulate on social medi", "caption1_mod": "Photograph showing a mural that was painted at Denver International Airport in 1994 that depicted people from around the world wearing masks started to circulate on social medi", "img_gen1": "SDtest/1622gen1.jpg", "original_caption2": "This viral image does not show a mural that was painted at the Denver International Airport in 1994. This image shows a modern day artwork that was likely created by CJ Trinidad.", "caption2_mod": "This viral image does not show a mural that was painted at the Denver International Airport in 1994. This image shows a modern day artwork that was likely created by CJ Trinidad.", "img_gen2": "SDtest/1622gen2.jpg", "label": 1}
{"img_local_path": "test/1623.png", "original_caption1": "JoeBiden taking questions in front of the green screen.", "caption1_mod": "Joe taking questions in front of the green screen.", "img_gen1": "SDtest/1623gen1.jpg", "original_caption2": "The claim that Biden was speaking in front of a green screen is part of a larger conspiracy theory holding that Biden presidency is being “faked” in one manner or another.", "caption2_mod": "The claim that PERSON was speaking in front of a green screen is part of a larger conspiracy theory holding that PERSON presidency is being “faked” in one manner or another.", "img_gen2": "SDtest/1623gen2.jpg", "label": 1}
{"img_local_path": "test/1624.jpg", "original_caption1": "A photograph shows North Korea leader Kim Jong-un laughing as he reads the book Fire and Fury: Inside the Trump White House.", "caption1_mod": "A photograph shows North Korea leader PERSON laughing as he reads the book Fire and Fury: Inside the  White House.", "img_gen1": "SDtest/1624gen1.jpg", "original_caption2": "This image was created by cropping a photograph of Kim to focus in on his face and then digitally adding an image of Fire and Fury.", "caption2_mod": "This image was created by cropping a photograph of PERSON to focus in on his face and then digitally adding an image of Fire and Fury.", "img_gen2": "SDtest/1624gen2.jpg", "label": 1}
{"img_local_path": "test/1625.jpg", "original_caption1": "Policemen stand guard near the state secretariat anticipating protests following reports of two women of menstruating age entering the Sabarimala temple, one of the world's largest Hindu pilgrimage sites, in Thiruvananthapuram, Kerala, India, last week.", "caption1_mod": "Policemen stand guard near the state secretariat anticipating protests following reports of two women of  age entering the Sabarimala temple, one of the world's largest Hindu pilgrimage sites, in Thiruvananthapuram, Kerala, India, last week.", "img_gen1": "SDtest/1625gen1.jpg", "original_caption2": "Policemen stand guard near the state secretariat anticipating protests in Kerala.", "caption2_mod": "Policemen stand guard near the state secretariat anticipating protests in Kerala.", "img_gen2": "SDtest/1625gen2.jpg", "label": 0}
{"img_local_path": "test/1626.jpg", "original_caption1": "Ben Murray's picture of a seaweed-scarfed snowman at Belhaven beach, Dunbar, with North Berwick Law and Bass Rock on the horizon.", "caption1_mod": "PERSON picture of a sea-scarfed man at Belhaven beach, Dunbar, with PERSON and PERSON on the horizon.", "img_gen1": "SDtest/1626gen1.jpg", "original_caption2": "Snowman on beach", "caption2_mod": "PERSON on beach", "img_gen2": "SDtest/1626gen2.jpg", "label": 0}
{"img_local_path": "test/1627.jpg", "original_caption1": "President Trump's older sister, federal judge Maryanne Trump Barry, said Trump was called \"Donnie Dimwit\" as a child, and is now \"acting like a nutjob.\"", "caption1_mod": "President PERSON's older sister, federal judge PERSON, said  was called \"Donnie Dimwit\" as a child, and is now \"acting like a nutjob.\"", "img_gen1": "SDtest/1627gen1.jpg", "original_caption2": "A cognitive assessment of Trump during the presidents’s annual medical exam and said he did “exceedingly well,”", "caption2_mod": "A cognitive assessment of  during the presidents’s annual medical exam and said he did “exceedingly well,”", "img_gen2": "SDtest/1627gen2.jpg", "label": 1}
{"img_local_path": "test/1628.jpg", "original_caption1": "A piece of art depicting a man watering a tree in an attempt to hang himself won a contest for depicting the current era of multiculturalism in Europe.", "caption1_mod": "A piece of art depicting a man watering a tree in an attempt to hang himself won a contest for depicting the current era of multiculturalism in Europe.", "img_gen1": "SDtest/1628gen1.jpg", "original_caption2": "The artwork shown was created by Friedrich Kunath in 2010 for a solo exhibition at the Andrea Rosen Gallery in New York", "caption2_mod": "The artwork shown was created by PERSON in 2010 for a solo exhibition at the Andrea Rosen Gallery in New York", "img_gen2": "SDtest/1628gen2.jpg", "label": 1}
{"img_local_path": "test/1629.jpg", "original_caption1": "Two Radicals Bernie Sanders and Rashida Tlaib Stand in Front of Empty Grocery Store Shelves and Push Socialism", "caption1_mod": "Two Radicals PERSON and PERSON in Front of Empty Grocery Store Shelves and Push Socialism", "img_gen1": "SDtest/1629gen1.jpg", "original_caption2": "Sanders and Tlaib were at a food pantry, not a grocery store, and they were talking about basic services like water and power being cut off to low-income residents, not “pushing socialism.”", "caption2_mod": " and PERSON were at a food pantry, not a grocery store, and they were talking about basic services like water and power being cut off to low-income residents, not “pushing socialism.”", "img_gen2": "SDtest/1629gen2.jpg", "label": 1}
{"img_local_path": "test/1630.jpg", "original_caption1": "Theo made his rainbow at school and found the shiny paper in a drawer.", "caption1_mod": "PERSON made his rainbow at school and found the shiny paper in a drawer.", "img_gen1": "SDtest/1630gen1.jpg", "original_caption2": "Theo at the window", "caption2_mod": "PERSON at the window", "img_gen2": "SDtest/1630gen2.jpg", "label": 0}
{"img_local_path": "test/1631.png", "original_caption1": "Photographs show Fox News host Chris Wallace vacationing on a private island formerly owned by Jeffrey Epstein.", "caption1_mod": "Photographs show Fox News host PERSON vacationing on a private island formerly owned by PERSON.", "img_gen1": "SDtest/1631gen1.jpg", "original_caption2": "The photographs seen above can be glimpsed in a contemporaneous Politico video interview of Wallace, during which the host described his four-day vacation with his wife at Clooney’s Italian home.", "caption2_mod": "The photographs seen above can be glimpsed in a contemporaneous Politico video interview of PERSON, during which the host described his four-day vacation with his wife at Clooney’s Italian home.", "img_gen2": "SDtest/1631gen2.jpg", "label": 1}
{"img_local_path": "test/1632.jpg", "original_caption1": "President Donald Trump posited that Canadian women were the second biggest threat to America following ISIS.", "caption1_mod": "President PERSON posited that Canadian women were the second biggest threat to America following .", "img_gen1": "SDtest/1632gen1.jpg", "original_caption2": "Young beautiful woman with canadian flag on cheek and red & white manicure sport fan", "caption2_mod": "Young beautiful woman with canadian flag on cheek and red & white manicure sport fan", "img_gen2": "SDtest/1632gen2.jpg", "label": 1}
{"img_local_path": "test/1633.jpg", "original_caption1": "A  surfer catches a wave in St Ives, as the tail end of Hurricane Epsilon brings strong winds and heavy rain  in Cornwall, UK", "caption1_mod": "A  surfer catches a wave in St Ives, as the tail end of Hurricane Epsilon brings strong winds and heavy rain  in Cornwall, UK", "img_gen1": "SDtest/1633gen1.jpg", "original_caption2": "A surfer catches a wave in St Ives, Cornwall. Strong winds and low pressure linked to Hurricane Epsilon in the North Atlantic created huge waves off the coast, as strong winds and heavy rain affected parts of the UK.", "caption2_mod": "A surfer catches a wave in St Ives, Cornwall. Strong winds and low pressure linked to Hurricane Epsilon in the North Atlantic created huge waves off the coast, as strong winds and heavy rain affected parts of the UK.", "img_gen2": "SDtest/1633gen2.jpg", "label": 0}
{"img_local_path": "test/1634.jpg", "original_caption1": "Vice presidential nominee Kamala Harris had an extramarital affair with former San Francisco Mayor and State Assembly Speaker Willie Brown, who gave her two political appointments that launched her political career.", "caption1_mod": "Vice presidential nominee PERSON had an extramarital affair with former San Francisco Mayor and State Assembly Speaker PERSON, who gave her two political appointments that launched her political career.", "img_gen1": "SDtest/1634gen1.jpg", "original_caption2": "U.S. Senator Kamala Harris speaking with attendees at the 2019 National Forum on Wages and Working People hosted by the Center for the American Progress Action Fund and the SEIU at the Enclave in Las Vegas, Nevada.", "caption2_mod": "U.S. Senator PERSON speaking with attendees at the 2019 National Forum on Wages and Working People hosted by the Center for the American Progress Action Fund and the SEIU at the Enclave in Las Vegas, Nevada.", "img_gen2": "SDtest/1634gen2.jpg", "label": 1}
{"img_local_path": "test/1635.jpg", "original_caption1": "Thousands flocked to a volcano in Iceland which erupted near the capital, Reykjavik.", "caption1_mod": "Thousands flocked to a volcano in Iceland which erupted near the capital, Reykjavik.", "img_gen1": "SDtest/1635gen1.jpg", "original_caption2": "Hikers look at the lava flowing from the erupting Fagradalsfjall volcano some 40 km west of the Icelandic capital Reykjavik, on 21 March 2021.", "caption2_mod": "Hikers look at the lava flowing from the erupting Fagradalsfjall volcano some 40 km west of the Icelandic capital Reykjavik, on 21 March 2021.", "img_gen2": "SDtest/1635gen2.jpg", "label": 0}
{"img_local_path": "test/1636.png", "original_caption1": "If you set the date of your Apple product to 1 January 1970 then reboot, it will bring up a retro-themed menu based on the old Apple computer operating system", "caption1_mod": "If you set the date of your Apple product to 1 January 1970 then reboot, it will bring up a retro-themed menu based on the old Apple computer operating system", "img_gen1": "SDtest/1636gen1.jpg", "original_caption2": "Never put January 1, 1970 as the date on your iPhone, unless you want to block it", "caption2_mod": "Never put January 1, 1970 as the date on your iPhone, unless you want to block it", "img_gen2": "SDtest/1636gen2.jpg", "label": 1}
{"img_local_path": "test/1637.jpg", "original_caption1": "President Obama Scores 102 on IQ Test, Lowest in Presidential History.", "caption1_mod": "President PERSON 102 on IQ Test, Lowest in Presidential History.", "img_gen1": "SDtest/1637gen1.jpg", "original_caption2": "A website ‘Empire News’ published an article on 12th December 2015 indicating that the U.S President Barak Obama has marked the lowest score among all the former U.S Presidents for IQ testing since 1913.", "caption2_mod": "A website ‘Empire News’ published an article on 12th December 2015 indicating that the U.S President PERSON has marked the lowest score among all the former U.S Presidents for IQ testing since 1913.", "img_gen2": "SDtest/1637gen2.jpg", "label": 1}
{"img_local_path": "test/1638.jpg", "original_caption1": "The F.B.I. investigated whether the firing of Mr. Comey was a national security threat.", "caption1_mod": "The F.B.I. investigated whether the firing of Mr. PERSON was a national security threat.", "img_gen1": "SDtest/1638gen1.jpg", "original_caption2": "James Comey was fired in May 2017 - just months after Donald Trump took office", "caption2_mod": "PERSON was fired in May 2017 - just months after PERSON took office", "img_gen2": "SDtest/1638gen2.jpg", "label": 0}
{"img_local_path": "test/1639.jpg", "original_caption1": "Ljuba Gajic outside her home, Pakrac, 1996", "caption1_mod": "PERSON outside her home, PERSON, 1996", "img_gen1": "SDtest/1639gen1.jpg", "original_caption2": "An elderly woman looks at her chickens outside of her home", "caption2_mod": "An elderly woman looks at her chickens outside of her home", "img_gen2": "SDtest/1639gen2.jpg", "label": 0}
{"img_local_path": "test/1640.jpg", "original_caption1": "Gibraltar will remain open to Spaniards.", "caption1_mod": "Gibraltar will remain open to Spaniards.", "img_gen1": "SDtest/1640gen1.jpg", "original_caption2": "A man walks down stairs on which a Union Jack has been painted at the British territory of Gibraltar, Friday Jan. 31, 2020.", "caption2_mod": "A man walks down stairs on which a Union PERSON has been painted at the British territory of Gibraltar, Friday Jan. 31, 2020.", "img_gen2": "SDtest/1640gen2.jpg", "label": 1}
{"img_local_path": "test/1641.jpg", "original_caption1": "On Wednesday mourners gather at the Olympic stadium in Abidjan, Ivory Coast, to remember the late Ivory Coast Prime Minister Hamed Bakayoko...", "caption1_mod": "On Wednesday mourners gather at the Olympic stadium in Abidjan, Ivory Coast, to remember the late Ivory Coast Prime Minister PERSON...", "img_gen1": "SDtest/1641gen1.jpg", "original_caption2": "People gather for a ceremony organized by Rally of Houphouetists for Democracy and Peace (RHDP) political party in homage to the late Ivory Coast Prime Minister Hamed Bakayoko at the Olympic Stadium in Abidjan, Ivory Coast on March 17, 2021.", "caption2_mod": "People gather for a ceremony organized by Rally of Houphouetists for Democracy and Peace (RHDP) political party in homage to the late Ivory Coast Prime Minister PERSON at the Olympic Stadium in Abidjan, Ivory Coast on March 17, 2021.", "img_gen2": "SDtest/1641gen2.jpg", "label": 0}
{"img_local_path": "test/1642.jpg", "original_caption1": "On Monday, beachgoers in Cape Town look at the carcass of a whale that has washed ashore.", "caption1_mod": "On Monday, beachgoers in Cape Town look at the carcass of a whale that has washed ashore.", "img_gen1": "SDtest/1642gen1.jpg", "original_caption2": "People look at the carcass of a Brydes Whale on Kommetjie beach in Cape Town.", "caption2_mod": "People look at the carcass of a Brydes Whale on Kommetjie beach in Cape Town.", "img_gen2": "SDtest/1642gen2.jpg", "label": 0}
{"img_local_path": "test/1643.jpg", "original_caption1": "Robert Grizz Maguire leans up against his truck in Granby.", "caption1_mod": "PERSON leans up against his truck in Granby.", "img_gen1": "SDtest/1643gen1.jpg", "original_caption2": "East Troublesome fire grows as residents evacuate near Granby", "caption2_mod": "East Troublesome fire grows as residents evacuate near Granby", "img_gen2": "SDtest/1643gen2.jpg", "label": 0}
{"img_local_path": "test/1644.jpg", "original_caption1": "A man clears snow from his car in Auchterarder, Perth and Kinross", "caption1_mod": "A man clears  from his car in Auchterarder, PERSON and Kinross", "img_gen1": "SDtest/1644gen1.jpg", "original_caption2": "Britons have been warned to expect widespread sub-zero temperatures", "caption2_mod": "Britons have been warned to expect widespread sub-zero temperatures", "img_gen2": "SDtest/1644gen2.jpg", "label": 0}
{"img_local_path": "test/1645.jpg", "original_caption1": "California has banned a popular type of ammunition, the .45 ACP.", "caption1_mod": "California has banned a popular type of ammunition, the .45 ACP.", "img_gen1": "SDtest/1645gen1.jpg", "original_caption2": "No, California has not banned a popular type of ammunition.", "caption2_mod": "No, California has not banned a popular type of ammunition.", "img_gen2": "SDtest/1645gen2.jpg", "label": 1}
{"img_local_path": "test/1646.jpg", "original_caption1": "Many of the Tube trains in London are quiet like this one on the Jubilee Line - but that is not the situation at all times", "caption1_mod": "Many of the Tube trains in London are quiet like this one on the Jubilee Line - but that is not the situation at all times", "img_gen1": "SDtest/1646gen1.jpg", "original_caption2": "A quiet Jubilee line westbound train carriage", "caption2_mod": "A quiet PERSON line westbound train carriage", "img_gen2": "SDtest/1646gen2.jpg", "label": 0}
{"img_local_path": "test/1647.jpg", "original_caption1": "Ted Nugent was killed in a Montana hunting accident.", "caption1_mod": "PERSON was  in a Montana hunting accident.", "img_gen1": "SDtest/1647gen1.jpg", "original_caption2": "Ted Nugent performing in a concert", "caption2_mod": "PERSON performing in a concert", "img_gen2": "SDtest/1647gen2.jpg", "label": 1}
{"img_local_path": "test/1648.jpg", "original_caption1": "Parkland mass shooting survivor Emma Gonzalez admitted to bullying a former student who later killed seventeen people.", "caption1_mod": "Parkland mass shooting survivor PERSON admitted to bullying a former student who later  seventeen people.", "img_gen1": "SDtest/1648gen1.jpg", "original_caption2": "Emma Gonzalez at the Rally to Support Firearm Safety Legislation in Fort Lauderdale", "caption2_mod": "PERSON at the Rally to Support Firearm Safety Legislation in Fort Lauderdale", "img_gen2": "SDtest/1648gen2.jpg", "label": 1}
{"img_local_path": "test/1649.jpg", "original_caption1": "Michelle Fradgley took this photograph at the Basingstoke Canal near Byfleet, Surrey", "caption1_mod": "PERSON took this photograph at the Basingstoke Canal near Byfleet, PERSON", "img_gen1": "SDtest/1649gen1.jpg", "original_caption2": "Canal houses reflected in water", "caption2_mod": "Canal houses reflected in water", "img_gen2": "SDtest/1649gen2.jpg", "label": 0}
{"img_local_path": "test/1650.jpg", "original_caption1": "The 200-metre stretch of mesh is meant to protect swimmers basking on the eastern coast's palm-lined beaches from shark attacks.", "caption1_mod": "The 200-metre stretch of mesh is meant to protect swimmers basking on the eastern coast's palm-lined beaches from shark attacks.", "img_gen1": "SDtest/1650gen1.jpg", "original_caption2": "Two men haul in a large net.", "caption2_mod": "Two men haul in a large net.", "img_gen2": "SDtest/1650gen2.jpg", "label": 0}
{"img_local_path": "test/1651.jpg", "original_caption1": "An American housewife in the 1930s who was committed to a psychiatric facility for the offense of failing to take “proper care of her husband”", "caption1_mod": "An American housewife in the 1930s who was committed to a psychiatric facility for the offense of failing to take “proper care of her husband”", "img_gen1": "SDtest/1651gen1.jpg", "original_caption2": "No evidence suggesting that image was of American origin, or that it depicts a patient undergoing “smile therapy” in a mental institution.", "caption2_mod": "No evidence suggesting that image was of American origin, or that it depicts a patient undergoing “smile therapy” in a mental institution.", "img_gen2": "SDtest/1651gen2.jpg", "label": 1}
{"img_local_path": "test/1652.jpg", "original_caption1": "A photograph shows UFO \"kill markings\" on the side of a German World War II anti-aircraft gun.", "caption1_mod": "A photograph shows UFO \" markings\" on the side of a German World War II anti-aircraft gun.", "img_gen1": "SDtest/1652gen1.jpg", "original_caption2": "The original photograph was lifted from the cover of a 1943 issue of Der Adler, a Nazi propaganda magazine", "caption2_mod": "The original photograph was lifted from the cover of a 1943 issue of Der Adler, a Nazi propaganda magazine", "img_gen2": "SDtest/1652gen2.jpg", "label": 1}
{"img_local_path": "test/1653.jpg", "original_caption1": "Anti-Brexit banners and placards near the Houses of Parliament in London.", "caption1_mod": "PERSON banners and placards near the Houses of Parliament in London.", "img_gen1": "SDtest/1653gen1.jpg", "original_caption2": "London (United Kingdom), Monday 14 January. Anti-Brexit protester prepares signs outside Parliament", "caption2_mod": "London (United Kingdom), Monday 14 January. Anti-Brexit protester prepares signs outside Parliament", "img_gen2": "SDtest/1653gen2.jpg", "label": 0}
{"img_local_path": "test/1654.jpg", "original_caption1": "Mr. Jones won the fiercely contested race by about 22,000 votes, out of more than 1.3 million.", "caption1_mod": "Mr. PERSON won the fiercely contested race by about 22,000 votes, out of more than 1.3 million.", "img_gen1": "SDtest/1654gen1.jpg", "original_caption2": "Doug Jones, the Democratic candidate for U.S. Senate, is accompanied by his wife, Louise, at an Election Night gathering of his supporters in Birmingham, Ala., on Dec. 12, 2017.", "caption2_mod": "PERSON, the Democratic candidate for U.S. Senate, is accompanied by his wife, PERSON, at an Election Night gathering of his supporters in Birmingham, Ala., on Dec. 12, 2017.", "img_gen2": "SDtest/1654gen2.jpg", "label": 0}
{"img_local_path": "test/1655.jpg", "original_caption1": "On Monday children in Kenya returned to their schools for the first time since they were closed in March to reduce the spread of coronavirus.", "caption1_mod": "On Monday children in Kenya returned to their schools for the first time since they were closed in March to reduce the spread of .", "img_gen1": "SDtest/1655gen1.jpg", "original_caption2": "A schoolgirl wears a face mask as she reads a book inside a classroom at the Olympic Primary School during the partial reopening of schools", "caption2_mod": "A schoolgirl wears a face mask as she reads a book inside a classroom at the Olympic Primary School during the partial reopening of schools", "img_gen2": "SDtest/1655gen2.jpg", "label": 0}
{"img_local_path": "test/1656.jpg", "original_caption1": "DJ Craig Harrison plays to festivalgoers at the first purpose-built, socially-distanced outdoor festival in the UK, held on the Gisburne Park Estate in Lancashire.", "caption1_mod": "DJ PERSON plays to festivalgoers at the first purpose-built, socially-distanced outdoor festival in the UK, held on the Gisburne Park Estate in Lancashire.", "img_gen1": "SDtest/1656gen1.jpg", "original_caption2": "A DJ plays to people gathered across a river", "caption2_mod": "A DJ plays to people gathered across a river", "img_gen2": "SDtest/1656gen2.jpg", "label": 0}
{"img_local_path": "test/1657.jpg", "original_caption1": "U.S. House Speaker Nancy Pelosi would become vice president if President Donald Trump left office before the end of his term.", "caption1_mod": "U.S. House Speaker PERSON would become vice president if President PERSON left office before the end of his term.", "img_gen1": "SDtest/1657gen1.jpg", "original_caption2": "A vacancy in the vice presidency is filled by the president, the claim that Pelosi would, de facto, become vice president if Mike Pence were elevated to president is therefore “False.”", "caption2_mod": "A vacancy in the vice presidency is filled by the president, the claim that  would, de facto, become vice president if PERSON were elevated to president is therefore “False.”", "img_gen2": "SDtest/1657gen2.jpg", "label": 1}
{"img_local_path": "test/1658.jpg", "original_caption1": "Old farm equipment at the former Drumbeg Quarry", "caption1_mod": "Old farm equipment at the former PERSON", "img_gen1": "SDtest/1658gen1.jpg", "original_caption2": "Barry Macintyre captures so much life in this photograph of rusting old farm equipment at the former Drumbeg Quarry near Drymen", "caption2_mod": "PERSON captures so much life in this photograph of rusting old farm equipment at the former PERSON near Drymen", "img_gen2": "SDtest/1658gen2.jpg", "label": 0}
{"img_local_path": "test/1659.jpg", "original_caption1": "Worshippers attend a mass at Santa Barbara Church in Madrid, Spain.", "caption1_mod": "Worshippers attend a mass at Santa Barbara Church in Madrid, Spain.", "img_gen1": "SDtest/1659gen1.jpg", "original_caption2": "People attend mass in a church", "caption2_mod": "People attend mass in a church", "img_gen2": "SDtest/1659gen2.jpg", "label": 0}
{"img_local_path": "test/1660.jpg", "original_caption1": "Vice presidential nominee Kamala Harris had an extramarital affair with former San Francisco Mayor and State Assembly Speaker Willie Brown, who gave her two political appointments that launched her political career.", "caption1_mod": "Vice presidential nominee PERSON had an extramarital affair with former San Francisco Mayor and State Assembly Speaker PERSON, who gave her two political appointments that launched her political career.", "img_gen1": "SDtest/1660gen1.jpg", "original_caption2": "Sen. Kamala Harris (D-Calif.) with attendees at the 2019 National Forum on Wages and Working People hosted by the Center for the American Progress Action Fund and the SEIU at the Enclave in Las Vegas. Former U.S. Vice President Joe Biden announced on Aug. 11, 2020, that he picked Harris as his running mate.", "caption2_mod": "Sen. PERSON (D-Calif.) with attendees at the 2019 National Forum on Wages and Working People hosted by the Center for the American Progress Action Fund and the SEIU at the Enclave in Las Vegas. Former U.S. Vice President PERSON announced on Aug. 11, 2020, that he picked PERSON as his running mate.", "img_gen2": "SDtest/1660gen2.jpg", "label": 1}
{"img_local_path": "test/1661.jpg", "original_caption1": "A drawing depicting Hungarian Prime Minister Viktor Orban is projected on the wall of a TV building during a protest on Monday.", "caption1_mod": "A drawing depicting Hungarian Prime Minister PERSON is projected on the wall of a TV building during a protest on Monday.", "img_gen1": "SDtest/1661gen1.jpg", "original_caption2": "A drawing depicting Hungarian President Viktor Orban is projected on the wall of the TV building during a protest.", "caption2_mod": "A drawing depicting Hungarian President PERSON is projected on the wall of the TV building during a protest.", "img_gen2": "SDtest/1661gen2.jpg", "label": 0}
{"img_local_path": "test/1662.jpg", "original_caption1": "Chinese officials were seeking approval from the Supreme People’s Court to start the mass killing of 20,000 people infected with the new coronavirus in an attempt to contain the disease", "caption1_mod": "Chinese officials were seeking approval from the Supreme People’s Court to start the mass ing of 20,000 people infected with the new  in an attempt to contain the disease", "img_gen1": "SDtest/1662gen1.jpg", "original_caption2": "HONG KONG, CHINA - JANUARY 22: A patient is transferred by an ambulance to the Infectious Disease Centre of Princess Margaret Hospital on January 22, 2020 in Hong Kong, China.", "caption2_mod": "HONG KONG, CHINA - JANUARY 22: A patient is transferred by an ambulance to the Infectious Disease Centre of Princess Margaret Hospital on January 22, 2020 in Hong Kong, China.", "img_gen2": "SDtest/1662gen2.jpg", "label": 1}
{"img_local_path": "test/1663.png", "original_caption1": "A taxi driver in Nigeria (or Zambia, or New York City, among other places) is using his cab to pick up victims.", "caption1_mod": "A taxi driver in Nigeria (or Zambia, or New York City, among other places) is using his cab to pick up victims.", "img_gen1": "SDtest/1663gen1.jpg", "original_caption2": "If this man were murdering people in Brooklyn (or Toledo, or Washington D.C., or Freeport et al), and if law enforcement had his photograph, it would have been reported in major U.S. newspapers, police would know about it, and official government sources would have published warning", "caption2_mod": "If this man were ing people in Brooklyn (or Toledo, or Washington D.C., or PERSON), and if law enforcement had his photograph, it would have been reported in major U.S. newspapers, police would know about it, and official government sources would have published warning", "img_gen2": "SDtest/1663gen2.jpg", "label": 1}
{"img_local_path": "test/1664.jpg", "original_caption1": "On Monday a girl peeks out from a tuk-tuk in Zanzibar's Stone Town in front of the bold green and yellow colours of an election poster.", "caption1_mod": "On Monday a girl peeks out from a tuk-tuk in Zanzibar's Stone Town in front of the bold green and yellow colours of an election poster.", "img_gen1": "SDtest/1664gen1.jpg", "original_caption2": "A girls peeks out from a tuk-tuk at a busy intersection in front of electoral posters for the Tanzanian ruling party Chama Cha Mapinduzi in Stone Town, Zanzibar, on October 26, 2020.", "caption2_mod": "A girls peeks out from a tuk-tuk at a busy intersection in front of elect posters for the Tanzanian ruling party Chama Cha Mapinduzi in Stone Town, Zanzibar, on October 26, 2020.", "img_gen2": "SDtest/1664gen2.jpg", "label": 0}
{"img_local_path": "test/1665.jpg", "original_caption1": "Jeremy Corbyn, the leader of the opposition Labour Party, in a speech on Thursday repeated his party's demand for a general election.", "caption1_mod": "PERSON, the leader of the opposition Labour Party, in a speech on Thursday repeated his party's demand for a general election.", "img_gen1": "SDtest/1665gen1.jpg", "original_caption2": "Jeremy Corbyn, leader of the Labour Party speaks on Brexit in Wakefield", "caption2_mod": "PERSON, leader of the Labour Party speaks on PERSON in Wakefield", "img_gen2": "SDtest/1665gen2.jpg", "label": 0}
{"img_local_path": "test/1666.jpg", "original_caption1": "A photograph shows a purple lobster caught in Maine. ", "caption1_mod": "A photograph shows a purple lobster caught in Maine. ", "img_gen1": "SDtest/1666gen1.jpg", "original_caption2": "'One-in-a-million' purple lobster fools the internet since it is not genuine", "caption2_mod": "'One-in-a-million' purple lobster fools the internet since it is not genuine", "img_gen2": "SDtest/1666gen2.jpg", "label": 1}
{"img_local_path": "test/1667.jpg", "original_caption1": "Heavy snowfall had be be cleared on Duke Street during one of the winters in the early 1900s", "caption1_mod": "Heavy fall had be be cleared on Duke Street during one of the winters in the early 1900s", "img_gen1": "SDtest/1667gen1.jpg", "original_caption2": "47 - Duke Street, Barrow-in-Furness 1910-15 Sankey Family Photography Collection", "caption2_mod": "47 - Duke Street, Barrow-in-Furness 1910-15 Sankey Family Photography Collection", "img_gen2": "SDtest/1667gen2.jpg", "label": 0}
{"img_local_path": "test/1668.jpg", "original_caption1": "Drinking boiled garlic water will cure COVID-19.", "caption1_mod": "Drinking boiled garlic water will cure .", "img_gen1": "SDtest/1668gen1.jpg", "original_caption2": "Eating fruit and vegetables and drinking water can be good for staying healthy. However, there is no evidence specific foods will help fight this particular virus.", "caption2_mod": "Eating fruit and vegetables and drinking water can be good for staying healthy. However, there is no evidence specific foods will help fight this particular virus.", "img_gen2": "SDtest/1668gen2.jpg", "label": 1}
{"img_local_path": "test/1669.jpg", "original_caption1": "An image that made the front page of The Times of a sudden snow fall", "caption1_mod": "An image that made the front page of The Times of a sudden  fall", "img_gen1": "SDtest/1669gen1.jpg", "original_caption2": "Punters in snow", "caption2_mod": "Punters in ", "img_gen2": "SDtest/1669gen2.jpg", "label": 0}
{"img_local_path": "test/1670.png", "original_caption1": "Viral video depicts the helicopter crash that killed NBA star Kobe Bryant.", "caption1_mod": "Viral video depicts the helicopter crash that  NBA star PERSON.", "img_gen1": "SDtest/1670gen1.jpg", "original_caption2": "that video depicted a different tragedy: a December 2018 crash in the United Arab Emirates, in which a rescue helicopter collided with a zip line at Jebel Jais, a mountain in Ras Al Khaimah, UAE.", "caption2_mod": "that video depicted a different tragedy: a December 2018 crash in the United Arab Emirates, in which a rescue helicopter collided with a zip line at Jebel Jais, a mountain in Ras Al Khaimah, UAE.", "img_gen2": "SDtest/1670gen2.jpg", "label": 1}
{"img_local_path": "test/1671.png", "original_caption1": "A white woman named Ricky Ellsworth was killed by a black police officer in Minneapolis, Minnesota", "caption1_mod": "A white woman named PERSON was  by a black police officer in Minneapolis, Minnesota", "img_gen1": "SDtest/1671gen1.jpg", "original_caption2": "Ellsworth was killed near Memphis, Tennessee, not in Minnesota", "caption2_mod": "PERSON was  near Memphis, Tennessee, not in Minnesota", "img_gen2": "SDtest/1671gen2.jpg", "label": 1}
{"img_local_path": "test/1672.png", "original_caption1": "Photographs show the Trump family looting historical artifacts from the White House.", "caption1_mod": "Photographs show the PERSON family looting historical artifacts from the White House.", "img_gen1": "SDtest/1672gen1.jpg", "original_caption2": "At the start of every president’s term, the incoming president has the opportunity to work with the White House curator to populate 1600 Pennsylvania Avenue with various paintings, sculptures, and other artifacts. These items are often loaned to the White House from various museums and galleries. At the end of the president’s term, these items are then returned.", "caption2_mod": "At the start of every president’s term, the incoming president has the opportunity to work with the White House curator to populate 1600 Pennsylvania Avenue with various paintings, sculptures, and other artifacts. These items are often loaned to the White House from various museums and galleries. At the end of the president’s term, these items are then returned.", "img_gen2": "SDtest/1672gen2.jpg", "label": 1}
{"img_local_path": "test/1673.jpg", "original_caption1": "Norwegian anti-submarine frigate HNoMS Thor Heyerdahl joins the UK's Carrier Strike Group as it sails across the Atlantic", "caption1_mod": "Norwegian anti-submarine frigate HNoMS PERSON joins the UK's Carrier Strike Group as it sails across the Atlantic", "img_gen1": "SDtest/1673gen1.jpg", "original_caption2": "A view of frigate HNoMS Thor Heyerdahl, HMS Queen Elizabeth, submarine hunter HMS Northumberland and tanker RFA Tideforce", "caption2_mod": "A view of frigate HNoMS PERSON, HMS PERSON, submarine hunter HMS Northumberland and tanker RFA Tideforce", "img_gen2": "SDtest/1673gen2.jpg", "label": 0}
{"img_local_path": "test/1674.jpg", "original_caption1": "Hundreds have reportedly been killed in Tigray and at least 30,000 people have crossed the border into Sudan.", "caption1_mod": "Hundreds have reportedly been  in PERSON and at least 30,000 people have crossed the border into Sudan.", "img_gen1": "SDtest/1674gen1.jpg", "original_caption2": "Hundreds of people walk next to and gather by the banks of the Setit River on the Sudan-Ethiopia border, on 14 November.", "caption2_mod": "Hundreds of people walk next to and gather by the banks of the Setit River on the Sudan-Ethiopia border, on 14 November.", "img_gen2": "SDtest/1674gen2.jpg", "label": 0}
{"img_local_path": "test/1675.jpg", "original_caption1": "Almaty, Kazakhstan: a tamed golden eagle takes part in a traditional hunting contest", "caption1_mod": "Almaty, Kazakhstan: a tamed golden eagle takes part in a traditional hunting contest", "img_gen1": "SDtest/1675gen1.jpg", "original_caption2": "A number of citizens of Kazakhstan are participating in a traditional hunting contest with their pet golden eagles in an area near the town of Esik in Almaty.", "caption2_mod": "A number of citizens of Kazakhstan are participating in a traditional hunting contest with their pet golden eagles in an area near the town of Esik in Almaty.", "img_gen2": "SDtest/1675gen2.jpg", "label": 0}
{"img_local_path": "test/1676.jpg", "original_caption1": "How Julia Jordan, Champion of Female Playwrights, Spends Her Sundays", "caption1_mod": "How PERSON, Champion of Female Playwrights, Spends Her Sundays", "img_gen1": "SDtest/1676gen1.jpg", "original_caption2": "“I’m primarily the dog walker, but usually the kids come with me.”", "caption2_mod": "“I’m primarily the dog walker, but usually the kids come with me.”", "img_gen2": "SDtest/1676gen2.jpg", "label": 0}
{"img_local_path": "test/1677.jpg", "original_caption1": "Kendrick Lamar bought and publicly destroyed the gun used by George Zimmerman to kill Trayvon Martin.", "caption1_mod": "PERSON bought and publicly destroyed the gun used by PERSON to  PERSON.", "img_gen1": "SDtest/1677gen1.jpg", "original_caption2": "Lamar preforming in 2013.", "caption2_mod": "PERSON preforming in 2013.", "img_gen2": "SDtest/1677gen2.jpg", "label": 1}
{"img_local_path": "test/1678.jpg", "original_caption1": "A photographer's self portrait with her mother is one of many works featured at the Bronx Documentary Center's third Annual Latin American Foto Festival.", "caption1_mod": "A photographer's self portrait with her mother is one of many works featured at the Bronx Documentary Center's third Annual Latin American Foto Festival.", "img_gen1": "SDtest/1678gen1.jpg", "original_caption2": "Two women embrace, wearing face masks", "caption2_mod": "Two women embrace, wearing face masks", "img_gen2": "SDtest/1678gen2.jpg", "label": 0}
{"img_local_path": "test/1679.jpg", "original_caption1": "Buildings around the UK were also lit in blue - the colour of the NHS logo - to pay tribute to the work of NHS staff.", "caption1_mod": "Buildings around the UK were also lit in blue - the colour of the NHS logo - to pay tribute to the work of NHS staff.", "img_gen1": "SDtest/1679gen1.jpg", "original_caption2": "Falkirk is home to The Kelpies, the largest equine sculptures in the world", "caption2_mod": "Falkirk is home to The Kelpies, the largest equine sculptures in the world", "img_gen2": "SDtest/1679gen2.jpg", "label": 0}
{"img_local_path": "test/1680.jpg", "original_caption1": "The stamps seen in news pictures of the packages were uncancelled, demonstrating that the parcels had not in fact gone through the mail system", "caption1_mod": "The stamps seen in news pictures of the packages were uncancelled, demonstrating that the parcels had not in fact gone through the mail system", "img_gen1": "SDtest/1680gen1.jpg", "original_caption2": "A handout photo made available by the Federal Bureau of Investigation (FBI) on shows the exterior of one of the suspicious packages which were received at multiple locations in the New York and Washington, D.C., areas and Florida between October 22 and 24, 2018.", "caption2_mod": "A handout photo made available by the Federal Bureau of Investigation (FBI) on shows the exterior of one of the suspicious packages which were received at multiple locations in the New York and Washington, D.C., areas and Florida between October 22 and 24, 2018.", "img_gen2": "SDtest/1680gen2.jpg", "label": 1}
{"img_local_path": "test/1681.jpg", "original_caption1": "President Lyndon Johnson holds one of his beagles, named Him, as he speaks with members of the White House press corps in 1964.", "caption1_mod": "President PERSON holds one of his beagles, named PERSON, as he speaks with members of the White House press corps in 1964.", "img_gen1": "SDtest/1681gen1.jpg", "original_caption2": "President Lyndon Johnson holds a beagle dog whilst speaking to a group of journalists", "caption2_mod": "President PERSON holds a beagle dog whilst speaking to a group of journalists", "img_gen2": "SDtest/1681gen2.jpg", "label": 0}
{"img_local_path": "test/1682.jpg", "original_caption1": "George Soros. A SS in the National Socialist German workers party. Nazi party. He served under Hitler.", "caption1_mod": "PERSON. A SS in the National Socialist German workers party. Nazi party. He served under PERSON.", "img_gen1": "SDtest/1682gen1.jpg", "original_caption2": "Soros couldn’t have joined the SS whose minimum age requirement was 17 even if he had wanted to.", "caption2_mod": "PERSON couldn’t have joined the SS whose minimum age requirement was 17 even if he had wanted to.", "img_gen2": "SDtest/1682gen2.jpg", "label": 1}
{"img_local_path": "test/1683.png", "original_caption1": "Posts shared on social media about the event purported to document the display of Nazi and Confederate flags offered for sale at the rally", "caption1_mod": "Posts shared on social media about the event purported to document the display of Nazi and Confederate flags offered for sale at the rally", "img_gen1": "SDtest/1683gen1.jpg", "original_caption2": "The image had been snapped at the Braddock’s Inn flea market in Pennsylvania over two months earlier, and the vendor displaying the offending material removed it upon request", "caption2_mod": "The image had been snapped at the Braddock’s Inn flea market in Pennsylvania over two months earlier, and the vendor displaying the offending material removed it upon request", "img_gen2": "SDtest/1683gen2.jpg", "label": 1}
{"img_local_path": "test/1684.jpg", "original_caption1": "United States would be designating “ANTIFA” as a “Terrorist Organization.”", "caption1_mod": "United States would be designating “” as a “Terrorist Organization.”", "img_gen1": "SDtest/1684gen1.jpg", "original_caption2": "A protester with an ANTIFA flag draped over his shoulders during a rally in Boston on May 31, 2020.", "caption2_mod": "A protester with an  flag dd over his shoulders during a rally in Boston on May 31, 2020.", "img_gen2": "SDtest/1684gen2.jpg", "label": 1}
{"img_local_path": "test/1685.JPG", "original_caption1": "People walk near the showrooms of Chinese and foreign car dealerships in Beijing. China’s auto industry has been hit hard by the coronavirus.", "caption1_mod": "People walk near the showrooms of Chinese and foreign car dealerships in Beijing. China’s auto industry has been hit hard by the .", "img_gen1": "SDtest/1685JPGgen1.jpg", "original_caption2": "FILE PHOTO: People walk near the showrooms of Chinese and foreign car dealerships in Beijing, China, Oct. 11, 2018.", "caption2_mod": "FILE PHOTO: People walk near the showrooms of Chinese and foreign car dealerships in Beijing, China, Oct. 11, 2018.", "img_gen2": "SDtest/1685JPGgen2.jpg", "label": 0}
{"img_local_path": "test/1686.png", "original_caption1": "A photo shows Queen Elizabeth laughing after Prince Philip \"pranked\" her by disguising himself as a palace guard.", "caption1_mod": "A photo shows PERSON laughing after PERSON \"pranked\" her by disguising himself as a palace guard.", "img_gen1": "SDtest/1686gen1.jpg", "original_caption2": "The prince and queen shortly before a ceremonial review of the Grenadier Guards at Windsor Castle.", "caption2_mod": "The prince and queen shortly before a ceremonial review of the Grenadier Guards at Windsor Castle.", "img_gen2": "SDtest/1686gen2.jpg", "label": 1}
{"img_local_path": "test/1687.jpg", "original_caption1": "Oggi Tomic taking a photo", "caption1_mod": "Oggi Tomic taking a photo", "img_gen1": "SDtest/1687gen1.jpg", "original_caption2": "A child holds a camera next to a destroyed bus", "caption2_mod": "A child holds a camera next to a destroyed bus", "img_gen2": "SDtest/1687gen2.jpg", "label": 0}
{"img_local_path": "test/1688.jpg", "original_caption1": "Zuckerberg secretly bought the “super yacht,” Ulysses, from a reclusive New Zealand businessman, Graeme Hart, for $150 million in October 2017.", "caption1_mod": "PERSON secretly bought the “super yacht,” Ulysses, from a reclusive New Zealand businessman, Graeme Hart, for $150 million in October 2017.", "img_gen1": "SDtest/1688gen1.jpg", "original_caption2": "The reports related to Mark purchasing a yacht are completely inaccurate as he did not purchase a yacht.", "caption2_mod": "The reports related to PERSON purchasing a yacht are completely inaccurate as he did not purchase a yacht.", "img_gen2": "SDtest/1688gen2.jpg", "label": 1}
{"img_local_path": "test/1689.jpg", "original_caption1": "Supporters of Felix Tshisekedi, the newly declared winner, in Kinshasa on Thursday.", "caption1_mod": "Supporters of PERSON, the newly declared winner, in Kinshasa on Thursday.", "img_gen1": "SDtest/1689gen1.jpg", "original_caption2": "Residents celebrate in Kinshasa, Congo, on Thursday after the election results were announced.", "caption2_mod": "Residents celebrate in Kinshasa, Congo, on Thursday after the election results were announced.", "img_gen2": "SDtest/1689gen2.jpg", "label": 0}
{"img_local_path": "test/1690.jpg", "original_caption1": "A video clip shows supporters of U.S. Sen. Bernie Sanders failing to identify a single country on an unlabeled world map.", "caption1_mod": "A video clip shows supporters of U.S. Sen. PERSON failing to identify a single country on an unlabeled world map.", "img_gen1": "SDtest/1690gen1.jpg", "original_caption2": "The video tweeted by Cruz was taken from a comedy segment taped for the “Jimmy Kimmel Live” late night talk show back in 2018, before Sanders entered the race for the 2020 Democratic presidential nomination.", "caption2_mod": "The video tweeted by PERSON was taken from a comedy segment taped for the “ Live” late night talk show back in 2018, before  entered the race for the 2020 Democratic presidential nomination.", "img_gen2": "SDtest/1690gen2.jpg", "label": 1}
{"img_local_path": "test/1691.jpg", "original_caption1": "A man exercises on a street in Edinburgh", "caption1_mod": "A man exercises on a street in Edinburgh", "img_gen1": "SDtest/1691gen1.jpg", "original_caption2": "A man jumps over a skipping rope in a street", "caption2_mod": "A man jumps over a skipping rope in a street", "img_gen2": "SDtest/1691gen2.jpg", "label": 0}
{"img_local_path": "test/1692.jpg", "original_caption1": "A video shows a naked child using bedsheets to escape from an upper story of Buckingham Palace.", "caption1_mod": "A video shows a  child using bedsheets to escape from an upper story of Buckingham Palace.", "img_gen1": "SDtest/1692gen1.jpg", "original_caption2": "The naked man was actually escaping from Princess Eleanor’s (Alexandra Park) chambers", "caption2_mod": "The  man was actually escaping from Princess Eleanor’s (Alexandra Park) chambers", "img_gen2": "SDtest/1692gen2.jpg", "label": 1}
{"img_local_path": "test/1693.jpg", "original_caption1": "Nabhaan Rizwan, left, and Roger Jean Nsengiyumva in \"Informer.\"", "caption1_mod": "PERSON, left, and PERSON in \"Informer.\"", "img_gen1": "SDtest/1693gen1.jpg", "original_caption2": "Nabhaan Rizwan and Roger Jean Nsengiyumva", "caption2_mod": "PERSON and PERSON", "img_gen2": "SDtest/1693gen2.jpg", "label": 0}
{"img_local_path": "test/1694.jpg", "original_caption1": "The inaugural committee spent $924,000 on seven-foot-high wreaths, moss-covered obelisks, flowers and other decorations to dress up Union Station.", "caption1_mod": "The inaugural committee spent $924,000 on seven-foot-high wreaths, moss-covered obelisks, flowers and other decorations to dress up Union Station.", "img_gen1": "SDtest/1694gen1.jpg", "original_caption2": "The inaugural committee spent $924,000 on seven-foot-high wreaths, moss-covered obelisks, flowers and other decorations to dress up Union Station.", "caption2_mod": "The inaugural committee spent $924,000 on seven-foot-high wreaths, moss-covered obelisks, flowers and other decorations to dress up Union Station.", "img_gen2": "SDtest/1694gen2.jpg", "label": 0}
{"img_local_path": "test/1695.jpg", "original_caption1": "President Obama trademarked the name 'Obamacare' and receives royalties every time the term is used.", "caption1_mod": "President PERSON trademarked the name 'care' and receives royalties every time the term is used.", "img_gen1": "SDtest/1695gen1.jpg", "original_caption2": "There was no truth that Obama family millions of dollars with Obamacare", "caption2_mod": "There was no truth that PERSON family millions of dollars with care", "img_gen2": "SDtest/1695gen2.jpg", "label": 1}
{"img_local_path": "test/1696.jpg", "original_caption1": "A photograph shows a soldier carrying a donkey on his back during World War II to prevent the animal from inadvertently setting off landmines.", "caption1_mod": "A photograph shows a soldier carrying a donkey on his back during World War II to prevent the animal from inadvertently setting off landmines.", "img_gen1": "SDtest/1696gen1.jpg", "original_caption2": "Coronavirus meme featuring “WWII donkey” is not what it claims to be", "caption2_mod": " meme featuring “WWII donkey” is not what it claims to be", "img_gen2": "SDtest/1696gen2.jpg", "label": 1}
{"img_local_path": "test/1697.jpg", "original_caption1": "Homeless people living on streets in Denver", "caption1_mod": "Homeless people living on streets in Denver", "img_gen1": "SDtest/1697gen1.jpg", "original_caption2": "The State Capitol Building in Colorado", "caption2_mod": "The State Capitol Building in Colorado", "img_gen2": "SDtest/1697gen2.jpg", "label": 0}
{"img_local_path": "test/1698.jpg", "original_caption1": "The castle's esplanade was a perfect spot for some off-piste skiing", "caption1_mod": "The castle's esplanade was a perfect spot for some off-piste skiing", "img_gen1": "SDtest/1698gen1.jpg", "original_caption2": "Picture shows an Edinburgh skier", "caption2_mod": "Picture shows an Edinburgh skier", "img_gen2": "SDtest/1698gen2.jpg", "label": 0}
{"img_local_path": "test/1699.jpg", "original_caption1": "We are confident that our reporting will stand up, said Ben Smith, the editor in chief of BuzzFeed News.", "caption1_mod": "We are confident that our reporting will stand up, said PERSON, the editor in chief of BuzzFeed News.", "img_gen1": "SDtest/1699gen1.jpg", "original_caption2": "BuzzFeed News Editor-in-Chief Ben Smith poses for a picture in his office in the newsroom at BuzzFeed headquarters.", "caption2_mod": "BuzzFeed News Editor-in-Chief PERSON poses for a picture in his office in the newsroom at BuzzFeed headquarters.", "img_gen2": "SDtest/1699gen2.jpg", "label": 1}